app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-19 02:57:40.655182"], ["text", "Candy Bomber"], ["title", "Bombs away"], ["updated_at", "2014-10-19 02:57:40.655182"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 4  [["text", "have sex never"], ["title", "Whitney and Steven"], ["updated_at", "2014-10-21 14:26:50.550105"]]